[ 
    {
        "id": "siberian_web_solutions",
        "titulo": "Siberian Web Solutions",
        "categoria": "WEBSITE",
        "tipo": "pc",
        "imagem": "siberianwebsolutions-website.png",
        "linguagens": ["wordpress"],
        "icon_acess": "website",
        "site": "https://siberianwebsolutions.com",
        "descricao": "Criação de um website institucional completo para a empresa Siberian Web Solutions, com foco em design responsivo e otimização para motores de busca (SEO). O site utiliza a plataforma WordPress para facilitar a gestão de conteúdo pelo cliente."
    },
    {
        "id": "greencity_solutions",
        "titulo": "Greencity Solutions",
        "categoria": "APPs",
        "tipo": "app",
        "imagem": "greencity-solutions.jpeg",
        "linguagens": ["flutter", "dart", "sql"],
        "icon_acess": "app-mobile",
        "site": "",
        "descricao": "Desenvolvimento de um aplicativo móvel (Android/iOS) para dimensionamento de sistemas fotovoltaicos. O app permite aos vendedores calcular a capacidade necessária, gerar orçamentos automáticos e gerenciar propostas de forma eficiente. Construído com Flutter, Dart e integração com banco de dados SQL."
    },
    {
        "id": "greencity_sustainable_energy",
        "titulo": "Greencity Sustainable Energy",
        "categoria": "WEBSITE",
        "tipo": "pc",
        "imagem": "greencity-website.jpeg",
        "linguagens": ["wordpress", "php"],
        "icon_acess": "website",
        "site": "",
        "descricao": "Website institucional e de vendas para empresa de energia fotovoltaica. Utilizado para captação de leads e apresentação de serviços. Implementação com WordPress e PHP para funcionalidades customizadas de contato e orçamento."
    },
    {
        "id": "sigaa_esig",
        "titulo": "Sistema Integrado de Gestão de Atividades Acadêmicas (SIGAA)",
        "categoria": "WEBSITE",
        "tipo": "pc",
        "imagem": "sigaa.png",
        "linguagens": ["postgresql", "hibernate", "java", "jboss"],
        "icon_acess": "website",
        "site": "",
        "descricao": "Participação no desenvolvimento de um dos maiores sistemas de gestão acadêmica do Brasil (utilizado por universidades federais). Minha atuação focou no desenvolvimento de novas funcionalidades em Java (POO) e PostgreSQL, seguindo os princípios de Design Patterns. Atuei diretamente na garantia de qualidade, realizando testes funcionais e manuais das novas features implementadas, além da documentação técnica das alterações."
    }
    
]