[    
    {
        "titulo": "Flutter",
        "percentagem": 90,
        "idicon": "flutter",
        "descricao": "Especialista em desenvolvimento Mobile multi-plataforma (iOS e Android). Foco na implementação de **Clean Architecture** e gerenciamento de estado eficiente para garantir performance nativa, interfaces ricas em UX/UI e código altamente escalável."
    },
    
    {
        "titulo": "Hibernate",
        "percentagem": 85,
        "idicon": "hibernate",
        "descricao": "Domínio da tecnologia ORM (Object-Relational Mapping) Hibernate para persistência de dados em aplicações Java. Garante o mapeamento eficiente de objetos e o trabalho direto com bancos relacionais."
    },

    {
        "titulo": "Angular",
        "percentagem": 70,
        "idicon": "angular",
        "descricao": "Conhecimento em desenvolvimento Front-end estruturado com Angular. Habilidade em arquitetura de componentes, gerenciamento de estado e consumo de APIs RESTful, fundamental para a construção de Single Page Applications (SPAs) robustas."
    },

    {
        "titulo": "JBoss / WildFly",
        "percentagem": 80,
        "idicon": "jboss",
        "descricao": "Experiência com o servidor de aplicação JBoss (atual WildFly) para desenvolvimento, deploy e manutenção de aplicações empresariais Java/EE. Fundamental para o contexto de sistemas legados de grande porte."
    },

    {
        "titulo": "Spring",
        "percentagem": 75,
        "idicon": "spring",
        "descricao": "Proficiência em desenvolvimento Back-end com Spring Framework (Java), aplicando os princípios SOLID, DDD e Design Patterns. Foco na criação de APIs REST seguras e de alta performance, essenciais para sistemas de software complexos."
    },

    {
        "titulo": "WordPress",
        "percentagem": 95,
        "idicon": "wordpress",
        "descricao": "Amplo domínio na criação, personalização e manutenção de websites institucionais e e-commerce. Proficiência em otimização de performance, segurança e desenvolvimento de temas e plugins customizados utilizando HTML, CSS, JavaScript e PHP."
    }
]